{
  "node": {
    "id": "portfolio-showcase",
    "type": "portfolio",
    "primitive": "List",
    "source": {
      "file": "examples/project-portfolio.mdx",
      "start": {
        "line": 8,
        "column": 1,
        "offset": 294
      },
      "end": {
        "line": 513,
        "column": 13,
        "offset": 23236
      }
    },
    "attributes": {
      "type": "portfolio",
      "id": "portfolio-showcase",
      "title": "Tom's Project Portfolio",
      "status": "active",
      "owner": "tom-materne",
      "category": "portfolio"
    },
    "title": "Tom's Project Portfolio",
    "description": "A comprehensive showcase of projects spanning game development, web applications,\ndeveloper tools, and creative platforms. Each project represents a milestone in\nmy programming journey and demonstrates different aspects of software development.Active ProjectsGenerate daily & weekly reports of political sittings and distribute them to a user base\nvia a website experience & optional emails.Chamber aims to make political information more accessible by automatically generating\ndigestible reports from parliamentary proceedings and delivering them directly to citizens\nwho want to stay informed about their government's activities.Researched various sources for parliamentary data, including official government APIs,\nweb scraping opportunities, and data availability across different jurisdictions.Build the core system that processes parliamentary data and generates human-readable reportsImplement email subscription system with personalized report deliveryCreate user-friendly web interface for browsing reports and managing subscriptionsThis project represents my belief that technology should be used to increase civic\nengagement and make democracy more accessible to everyday people.Blog site for all things on my creative side - a platform where I explore photography,\npainting, music, and other artistic endeavors alongside my technical work.This project serves as a creative outlet and demonstrates my ability to build content\nmanagement systems while exploring the intersection of technology and art.Exploring how programming and artistic expression can complement and enhance each other.\nMany of the same principles that make good code also make good art: composition,\nbalance, iteration, and attention to detail.Built a responsive gallery system for showcasing photography work with metadata and taggingIntegrate music player for original compositions and coversDocumenting my painting journey with progress photos, technique notes, and reflections.Just like coding, painting is about iteration, learning from mistakes, and gradually\nbuilding more complex skills on top of fundamental techniques.Game Development ProjectsA fast-paced multiplayer 1v1 capture the flag game built with GameMaker and Java backend.\nThis project combines my game development roots with my backend programming skills to\ncreate a competitive multiplayer experience.Studied various multiplayer game architectures, latency compensation techniques,\nand anti-cheat systems to inform the design decisions.Built the game client in GameMaker with smooth movement, responsive controls, and network communicationImplemented authoritative game server in Java with player synchronization and match managementDesign and implement skill-based matchmaking for balanced competitive matchesBuilding multiplayer games presents unique challenges around network synchronization,\nlatency compensation, and maintaining game state consistency across clients.Developer Tools & LibrariesAn open-source framework for interfacing between Java servers and GameMaker: Studio game clients.\nThis project solved a real problem I faced when building multiplayer games and has helped\nother developers in the GameMaker community.Deep dive into GameMaker's networking capabilities, socket implementations, and\ncommunication protocols to design an optimal interface layer.Built the foundational library with robust client-server communication protocolsCreated comprehensive documentation with code examples and getting-started guidesProvide ongoing support to developers using the library and maintain compatibilityThe library has been adopted by multiple independent game developers and has received\npositive feedback from the GameMaker community.This project taught me valuable lessons about API design, documentation, backwards\ncompatibility, and maintaining open source projects.Web Applications & PlatformsA hyper-minimalistic project and task management tool designed specifically for developers.\nAfter multiple iterations and redesigns, I'm currently working on a streamlined version\nthat focuses on simplicity and developer workflow integration.Researching how developers currently manage projects and tasks, what tools they use,\nand where existing solutions fall short of their needs.Exploring why developers often prefer simple, focused tools over feature-heavy alternatives.\nSometimes the best tool is the one that gets out of your way and lets you focus on the work.Narrowed down to core features: project creation, task management, and simple time trackingBuilding a clean, distraction-free interface that prioritizes function over formIntegrate with git repositories, development tools, and common developer workflowsThe goal is to create a tool so simple and intuitive that it becomes invisible -\nhelping developers stay organized without adding cognitive overhead.Backend & Infrastructure ProjectsStack setup for a golang API with bun testing, postgres database, and S3 storage for\nlocal & production environments. This project serves as a template and learning resource\nfor other developers looking to set up similar infrastructure.Comprehensive study of the Go ecosystem, comparing different frameworks, ORMs, and\ndeployment strategies to identify best practices and optimal tool combinations.Set up complete docker-compose environment with Go app, PostgreSQL, and MinIO (S3 compatible storage)Integrated Drizzle ORM for type-safe database operations with migrations and schema managementConfigured end-to-end testing pipeline using Bun for fast, reliable test executionCreated comprehensive documentation for deploying the stack to production environmentsThe repository has helped several developers bootstrap their Go API projects and serves\nas a reference for modern Go development practices.This project demonstrates current best practices in API development, including\ncontainerization, type safety, comprehensive testing, and clear documentation.Experimental & Learning ProjectsA project specifically designed to explore the transition from JavaScript to TypeScript\nand experiment with different approaches to state management and task organization.Documented the process of migrating a JavaScript project to TypeScript, including\nchallenges faced, benefits realized, and lessons learned about type safety.Reflecting on the transition from dynamic to static typing, the initial resistance,\nthe gradual appreciation, and ultimately the realization that TypeScript makes\nJavaScript development more enjoyable and productive.Built initial version in vanilla JavaScript to establish baseline functionalitySystematically migrated codebase to TypeScript, adding type definitions and improving code qualityCompared performance, developer experience, and code maintainability between JS and TS versionsThis project solidified my understanding of TypeScript's benefits and gave me practical\nexperience in migrating existing codebases to adopt type safety.Creative & Artistic ProjectsA curated collection of photography work spanning landscapes, street photography,\nand experimental compositions. This creative pursuit complements my technical work\nand provides a different lens for seeing and documenting the world.Continuous learning about composition, lighting, post-processing, and different\nphotographic styles to improve technical and artistic skills.Specialized focus on underwater photography while snorkeling, capturing marine life\nand underwater landscapes. This challenging environment requires special techniques\nand equipment considerations.Underwater photography presents unique challenges: limited light, water refraction,\nmarine life behavior, and equipment protection - similar to debugging complex systems!Select and organize best photographs into cohesive collections for online portfolioShare photography work on Instagram and other platforms to build an audience and get feedbackProfessional DevelopmentLed coaching for 8 different badminton teams at competitive city level, developing\nleadership skills, teaching abilities, and team management experience that directly\ntranslates to software development team dynamics.Studied effective coaching and teaching methodologies, sports psychology, and\nteam motivation techniques to become a more effective leader.Successfully managed and coordinated practice schedules, competitions, and development plans for 8 teamsCreated personalized training programs for players at different skill levels and tracked progressDeveloped game strategies, analyzed opponent patterns, and prepared teams for high-level competitionLed teams to compete successfully at the highest level in local city competitions,\nwith several teams achieving top placements.The leadership and analytical skills developed in sports coaching directly apply to\nsoftware development team leadership and code review processes.Reflection & Future DirectionsLooking across this portfolio of projects, several themes emerge that have shaped my\napproach to software development and creative work:Iteration and Learning: Nearly every project has gone through multiple versions,\nredesigns, or pivots. This isn't failure - it's the natural process of learning and\nimproving. Each iteration teaches something new about the problem space, user needs,\nor technical constraints.Cross-Pollination: Skills learned in one domain consistently apply to others.\nLeadership from coaching translates to software team dynamics. Visual composition\nfrom photography improves UI design. Game development networking knowledge applies\nto web API design.Community and Open Source: The projects that have had the most impact are those\nthat solve problems for others, not just myself. Open source contributions and\ncommunity resources create value that extends far beyond the initial effort.Balance of Technical and Creative: The most fulfilling projects combine technical\nchallenges with creative expression or meaningful impact. Pure technical exercises\nare valuable for learning, but projects with purpose and personality are what I\nremember and continue to develop.Explore how AI tools can enhance development workflows and create new possibilities\nfor creative and productivity applicationsDevelop projects that have positive environmental impact or help others make more\nsustainable technology choicesCreate resources and tools that help other developers learn and grow, building on\nmy experience with documentation and teachingFuture projects will prioritize: meaningful impact, technical excellence, community value,\nand personal growth. The goal is to build things that matter, not just things that work.Time spent curating and documenting this comprehensive project portfolio",
    "children": [
      "chamber-project",
      "burning-blends",
      "arena-game",
      "gm-server-framework",
      "devpad-project",
      "golang-api-stack",
      "todo-tracker-evolution",
      "photography-portfolio",
      "badminton-coaching",
      "portfolio-reflection",
      "future-directions",
      "tag-0f0b2e9d",
      "tag-7fdc1bb8",
      "tag-188ed460",
      "tag-1553c5b4",
      "tag-5fc3eeaf",
      "tag-d63eb94f",
      "time-spent-curating-and-documenting-this-comprehen-f00e4b7f"
    ]
  },
  "edges": [
    {
      "id": "portfolio-showcase-contains-chamber-project",
      "from": "portfolio-showcase",
      "to": "chamber-project",
      "type": "contains"
    },
    {
      "id": "portfolio-showcase-contains-burning-blends",
      "from": "portfolio-showcase",
      "to": "burning-blends",
      "type": "contains"
    },
    {
      "id": "portfolio-showcase-contains-arena-game",
      "from": "portfolio-showcase",
      "to": "arena-game",
      "type": "contains"
    },
    {
      "id": "portfolio-showcase-contains-gm-server-framework",
      "from": "portfolio-showcase",
      "to": "gm-server-framework",
      "type": "contains"
    },
    {
      "id": "portfolio-showcase-contains-devpad-project",
      "from": "portfolio-showcase",
      "to": "devpad-project",
      "type": "contains"
    },
    {
      "id": "portfolio-showcase-contains-golang-api-stack",
      "from": "portfolio-showcase",
      "to": "golang-api-stack",
      "type": "contains"
    },
    {
      "id": "portfolio-showcase-contains-todo-tracker-evolution",
      "from": "portfolio-showcase",
      "to": "todo-tracker-evolution",
      "type": "contains"
    },
    {
      "id": "portfolio-showcase-contains-photography-portfolio",
      "from": "portfolio-showcase",
      "to": "photography-portfolio",
      "type": "contains"
    },
    {
      "id": "portfolio-showcase-contains-badminton-coaching",
      "from": "portfolio-showcase",
      "to": "badminton-coaching",
      "type": "contains"
    },
    {
      "id": "portfolio-showcase-contains-portfolio-reflection",
      "from": "portfolio-showcase",
      "to": "portfolio-reflection",
      "type": "contains"
    },
    {
      "id": "portfolio-showcase-contains-future-directions",
      "from": "portfolio-showcase",
      "to": "future-directions",
      "type": "contains"
    },
    {
      "id": "portfolio-showcase-contains-tag-0f0b2e9d",
      "from": "portfolio-showcase",
      "to": "tag-0f0b2e9d",
      "type": "contains"
    },
    {
      "id": "portfolio-showcase-contains-tag-7fdc1bb8",
      "from": "portfolio-showcase",
      "to": "tag-7fdc1bb8",
      "type": "contains"
    },
    {
      "id": "portfolio-showcase-contains-tag-188ed460",
      "from": "portfolio-showcase",
      "to": "tag-188ed460",
      "type": "contains"
    },
    {
      "id": "portfolio-showcase-contains-tag-1553c5b4",
      "from": "portfolio-showcase",
      "to": "tag-1553c5b4",
      "type": "contains"
    },
    {
      "id": "portfolio-showcase-contains-tag-5fc3eeaf",
      "from": "portfolio-showcase",
      "to": "tag-5fc3eeaf",
      "type": "contains"
    },
    {
      "id": "portfolio-showcase-contains-tag-d63eb94f",
      "from": "portfolio-showcase",
      "to": "tag-d63eb94f",
      "type": "contains"
    },
    {
      "id": "portfolio-showcase-contains-time-spent-curating-and-documenting-this-comprehen-f00e4b7f",
      "from": "portfolio-showcase",
      "to": "time-spent-curating-and-documenting-this-comprehen-f00e4b7f",
      "type": "contains"
    }
  ],
  "relatedNodes": {
    "chamber-project": {
      "id": "chamber-project",
      "type": "project",
      "primitive": "Branch",
      "source": {
        "file": "examples/project-portfolio.mdx",
        "start": {
          "line": 17,
          "column": 3,
          "offset": 713
        },
        "end": {
          "line": 66,
          "column": 13,
          "offset": 2988
        }
      },
      "attributes": {
        "type": "project",
        "id": "chamber-project",
        "title": "Chamber",
        "status": "development",
        "category": "web-application",
        "priority": "high",
        "githubUrl": "https://github.com/f0rbit/chamber",
        "liveUrl": "https://chamber.net.au"
      },
      "title": "Chamber",
      "content": "Generate daily & weekly reports of political sittings and distribute them to a user base\nvia a website experience & optional emails.Chamber aims to make political information more accessible by automatically generating\ndigestible reports from parliamentary proceedings and delivering them directly to citizens\nwho want to stay informed about their government's activities.Researched various sources for parliamentary data, including official government APIs,\nweb scraping opportunities, and data availability across different jurisdictions.Build the core system that processes parliamentary data and generates human-readable reportsImplement email subscription system with personalized report deliveryCreate user-friendly web interface for browsing reports and managing subscriptionsThis project represents my belief that technology should be used to increase civic\nengagement and make democracy more accessible to everyday people.",
      "children": [
        "political-data-sources",
        "report-generation-system",
        "email-distribution",
        "web-interface",
        "skill-16c3ade1",
        "skill-dc2395cb",
        "skill-7fae8c78",
        "skill-79824f1e",
        "skill-f30817ac",
        "skill-228b3685",
        "this-project-represents-my-belief-that-technology-d9486abe",
        "collaborator-84f9cede",
        "tag-a8860d85",
        "tag-4ca7ab6a",
        "tag-d3170190"
      ]
    },
    "burning-blends": {
      "id": "burning-blends",
      "type": "project",
      "primitive": "Branch",
      "source": {
        "file": "examples/project-portfolio.mdx",
        "start": {
          "line": 68,
          "column": 3,
          "offset": 2992
        },
        "end": {
          "line": 113,
          "column": 13,
          "offset": 5136
        }
      },
      "attributes": {
        "type": "project",
        "id": "burning-blends",
        "title": "Burning Blends",
        "status": "development",
        "category": "blog-platform",
        "githubUrl": "https://github.com/f0rbit/burning-blends",
        "liveUrl": "https://blends.blog"
      },
      "title": "Burning Blends",
      "content": "Blog site for all things on my creative side - a platform where I explore photography,\npainting, music, and other artistic endeavors alongside my technical work.This project serves as a creative outlet and demonstrates my ability to build content\nmanagement systems while exploring the intersection of technology and art.Exploring how programming and artistic expression can complement and enhance each other.\nMany of the same principles that make good code also make good art: composition,\nbalance, iteration, and attention to detail.Built a responsive gallery system for showcasing photography work with metadata and taggingIntegrate music player for original compositions and coversDocumenting my painting journey with progress photos, technique notes, and reflections.Just like coding, painting is about iteration, learning from mistakes, and gradually\nbuilding more complex skills on top of fundamental techniques.",
      "children": [
        "creative-tech-intersection",
        "photography-gallery",
        "music-integration",
        "painting-documentation",
        "skill-d9cfe77d",
        "skill-2f994cf6",
        "skill-0d08e68d",
        "skill-0962f9f9",
        "tag-b9646a93",
        "tag-e6423b38",
        "tag-a84be93e"
      ]
    },
    "arena-game": {
      "id": "arena-game",
      "type": "project",
      "primitive": "Branch",
      "source": {
        "file": "examples/project-portfolio.mdx",
        "start": {
          "line": 117,
          "column": 3,
          "offset": 5172
        },
        "end": {
          "line": 153,
          "column": 13,
          "offset": 6932
        }
      },
      "attributes": {
        "type": "project",
        "id": "arena-game",
        "title": "Arena",
        "status": "paused",
        "category": "multiplayer-game"
      },
      "title": "Arena",
      "content": "A fast-paced multiplayer 1v1 capture the flag game built with GameMaker and Java backend.\nThis project combines my game development roots with my backend programming skills to\ncreate a competitive multiplayer experience.Studied various multiplayer game architectures, latency compensation techniques,\nand anti-cheat systems to inform the design decisions.Built the game client in GameMaker with smooth movement, responsive controls, and network communicationImplemented authoritative game server in Java with player synchronization and match managementDesign and implement skill-based matchmaking for balanced competitive matchesBuilding multiplayer games presents unique challenges around network synchronization,\nlatency compensation, and maintaining game state consistency across clients.",
      "children": [
        "multiplayer-architecture",
        "game-client",
        "java-server",
        "matchmaking-system",
        "building-multiplayer-games-presents-unique-challen-d289ee14",
        "skill-07da874a",
        "skill-43d1f407",
        "skill-9ee92c42",
        "skill-de476e78",
        "tag-1a4d7de9",
        "tag-a76bf13f",
        "tag-534a859f"
      ]
    },
    "gm-server-framework": {
      "id": "gm-server-framework",
      "type": "project",
      "primitive": "Branch",
      "source": {
        "file": "examples/project-portfolio.mdx",
        "start": {
          "line": 157,
          "column": 3,
          "offset": 6970
        },
        "end": {
          "line": 200,
          "column": 13,
          "offset": 9043
        }
      },
      "attributes": {
        "type": "project",
        "id": "gm-server-framework",
        "title": "GM-Server Framework",
        "status": "completed",
        "category": "open-source-library",
        "language": "java"
      },
      "title": "GM-Server Framework",
      "content": "An open-source framework for interfacing between Java servers and GameMaker: Studio game clients.\nThis project solved a real problem I faced when building multiplayer games and has helped\nother developers in the GameMaker community.Deep dive into GameMaker's networking capabilities, socket implementations, and\ncommunication protocols to design an optimal interface layer.Built the foundational library with robust client-server communication protocolsCreated comprehensive documentation with code examples and getting-started guidesProvide ongoing support to developers using the library and maintain compatibilityThe library has been adopted by multiple independent game developers and has received\npositive feedback from the GameMaker community.This project taught me valuable lessons about API design, documentation, backwards\ncompatibility, and maintaining open source projects.",
      "children": [
        "gamemaker-networking",
        "core-library",
        "documentation-site",
        "community-support",
        "the-library-has-been-adopted-by-multiple-independe-baba2f8f",
        "skill-22c19654",
        "skill-4a7ac3d3",
        "skill-0d11b4e9",
        "skill-6173c5a4",
        "this-project-taught-me-valuable-lessons-about-api-735f28a8",
        "tag-6954c236",
        "tag-c81ac582",
        "tag-5a2ddd8a",
        "tag-68f6ab33"
      ]
    },
    "devpad-project": {
      "id": "devpad-project",
      "type": "project",
      "primitive": "Branch",
      "source": {
        "file": "examples/project-portfolio.mdx",
        "start": {
          "line": 204,
          "column": 3,
          "offset": 9082
        },
        "end": {
          "line": 244,
          "column": 13,
          "offset": 11127
        }
      },
      "attributes": {
        "type": "project",
        "id": "devpad-project",
        "title": "DevPad",
        "status": "redesigning",
        "category": "productivity-tool"
      },
      "title": "DevPad",
      "content": "A hyper-minimalistic project and task management tool designed specifically for developers.\nAfter multiple iterations and redesigns, I'm currently working on a streamlined version\nthat focuses on simplicity and developer workflow integration.Researching how developers currently manage projects and tasks, what tools they use,\nand where existing solutions fall short of their needs.Exploring why developers often prefer simple, focused tools over feature-heavy alternatives.\nSometimes the best tool is the one that gets out of your way and lets you focus on the work.Narrowed down to core features: project creation, task management, and simple time trackingBuilding a clean, distraction-free interface that prioritizes function over formIntegrate with git repositories, development tools, and common developer workflowsThe goal is to create a tool so simple and intuitive that it becomes invisible -\nhelping developers stay organized without adding cognitive overhead.",
      "children": [
        "developer-productivity",
        "minimalism-in-tools",
        "mvp-definition",
        "ui-redesign",
        "developer-workflow-integration",
        "the-goal-is-to-create-a-tool-so-simple-and-intuiti-183092b3",
        "skill-ce82db49",
        "skill-d4d2b68f",
        "skill-57b8db17",
        "tag-ba6dd4b1",
        "tag-294445d7",
        "tag-d7b6fa57"
      ]
    },
    "golang-api-stack": {
      "id": "golang-api-stack",
      "type": "project",
      "primitive": "Branch",
      "source": {
        "file": "examples/project-portfolio.mdx",
        "start": {
          "line": 248,
          "column": 3,
          "offset": 11171
        },
        "end": {
          "line": 301,
          "column": 13,
          "offset": 13716
        }
      },
      "attributes": {
        "type": "project",
        "id": "golang-api-stack",
        "title": "Go API Stack Example",
        "status": "completed",
        "category": "development-template",
        "githubUrl": "https://github.com/f0rbit/golang-stack-example"
      },
      "title": "Go API Stack Example",
      "content": "Stack setup for a golang API with bun testing, postgres database, and S3 storage for\nlocal & production environments. This project serves as a template and learning resource\nfor other developers looking to set up similar infrastructure.Comprehensive study of the Go ecosystem, comparing different frameworks, ORMs, and\ndeployment strategies to identify best practices and optimal tool combinations.Set up complete docker-compose environment with Go app, PostgreSQL, and MinIO (S3 compatible storage)Integrated Drizzle ORM for type-safe database operations with migrations and schema managementConfigured end-to-end testing pipeline using Bun for fast, reliable test executionCreated comprehensive documentation for deploying the stack to production environmentsThe repository has helped several developers bootstrap their Go API projects and serves\nas a reference for modern Go development practices.This project demonstrates current best practices in API development, including\ncontainerization, type safety, comprehensive testing, and clear documentation.",
      "children": [
        "go-ecosystem-study",
        "docker-containerization",
        "database-integration",
        "testing-framework",
        "deployment-guide",
        "the-repository-has-helped-several-developers-boots-b649393a",
        "skill-6c03f795",
        "skill-3326505e",
        "skill-5d64f1d1",
        "skill-5deadf5f",
        "skill-ea3ad0df",
        "this-project-demonstrates-current-best-practices-i-dfbed54b",
        "tag-df0cf54c",
        "tag-67497d32",
        "tag-86a74ab2",
        "tag-49eecbb9"
      ]
    },
    "todo-tracker-evolution": {
      "id": "todo-tracker-evolution",
      "type": "project",
      "primitive": "Branch",
      "source": {
        "file": "examples/project-portfolio.mdx",
        "start": {
          "line": 305,
          "column": 3,
          "offset": 13759
        },
        "end": {
          "line": 349,
          "column": 13,
          "offset": 15901
        }
      },
      "attributes": {
        "type": "project",
        "id": "todo-tracker-evolution",
        "title": "Todo Tracker Evolution",
        "status": "completed",
        "category": "learning-project"
      },
      "title": "Todo Tracker Evolution",
      "content": "A project specifically designed to explore the transition from JavaScript to TypeScript\nand experiment with different approaches to state management and task organization.Documented the process of migrating a JavaScript project to TypeScript, including\nchallenges faced, benefits realized, and lessons learned about type safety.Reflecting on the transition from dynamic to static typing, the initial resistance,\nthe gradual appreciation, and ultimately the realization that TypeScript makes\nJavaScript development more enjoyable and productive.Built initial version in vanilla JavaScript to establish baseline functionalitySystematically migrated codebase to TypeScript, adding type definitions and improving code qualityCompared performance, developer experience, and code maintainability between JS and TS versionsThis project solidified my understanding of TypeScript's benefits and gave me practical\nexperience in migrating existing codebases to adopt type safety.",
      "children": [
        "js-to-ts-transition",
        "typescript-adoption-journey",
        "js-implementation",
        "typescript-migration",
        "performance-comparison",
        "skill-b0466ce8",
        "skill-5e01cbce",
        "skill-77c82a04",
        "this-project-solidified-my-understanding-of-typesc-6137dbd9",
        "tag-b4e90b0b",
        "tag-c19256ef",
        "tag-f085aa08"
      ]
    },
    "photography-portfolio": {
      "id": "photography-portfolio",
      "type": "project",
      "primitive": "Branch",
      "source": {
        "file": "examples/project-portfolio.mdx",
        "start": {
          "line": 353,
          "column": 3,
          "offset": 15940
        },
        "end": {
          "line": 399,
          "column": 13,
          "offset": 18151
        }
      },
      "attributes": {
        "type": "project",
        "id": "photography-portfolio",
        "title": "Photography Collection",
        "status": "ongoing",
        "category": "creative-work"
      },
      "title": "Photography Collection",
      "content": "A curated collection of photography work spanning landscapes, street photography,\nand experimental compositions. This creative pursuit complements my technical work\nand provides a different lens for seeing and documenting the world.Continuous learning about composition, lighting, post-processing, and different\nphotographic styles to improve technical and artistic skills.Specialized focus on underwater photography while snorkeling, capturing marine life\nand underwater landscapes. This challenging environment requires special techniques\nand equipment considerations.Underwater photography presents unique challenges: limited light, water refraction,\nmarine life behavior, and equipment protection - similar to debugging complex systems!Select and organize best photographs into cohesive collections for online portfolioShare photography work on Instagram and other platforms to build an audience and get feedback",
      "children": [
        "photography-techniques",
        "snorkeling-photography",
        "portfolio-curation",
        "social-media-presence",
        "skill-43ff3315",
        "skill-7c454d6b",
        "skill-78f32ff3",
        "skill-9d1a70fa",
        "tag-b51e6fc3",
        "tag-fe25725b",
        "tag-93ef5385",
        "tag-c0910f33"
      ]
    },
    "badminton-coaching": {
      "id": "badminton-coaching",
      "type": "project",
      "primitive": "Branch",
      "source": {
        "file": "examples/project-portfolio.mdx",
        "start": {
          "line": 403,
          "column": 3,
          "offset": 18186
        },
        "end": {
          "line": 449,
          "column": 13,
          "offset": 20345
        }
      },
      "attributes": {
        "type": "project",
        "id": "badminton-coaching",
        "title": "Badminton Coaching Leadership",
        "status": "completed",
        "category": "leadership-development"
      },
      "title": "Badminton Coaching Leadership",
      "content": "Led coaching for 8 different badminton teams at competitive city level, developing\nleadership skills, teaching abilities, and team management experience that directly\ntranslates to software development team dynamics.Studied effective coaching and teaching methodologies, sports psychology, and\nteam motivation techniques to become a more effective leader.Successfully managed and coordinated practice schedules, competitions, and development plans for 8 teamsCreated personalized training programs for players at different skill levels and tracked progressDeveloped game strategies, analyzed opponent patterns, and prepared teams for high-level competitionLed teams to compete successfully at the highest level in local city competitions,\nwith several teams achieving top placements.The leadership and analytical skills developed in sports coaching directly apply to\nsoftware development team leadership and code review processes.",
      "children": [
        "coaching-methodologies",
        "team-management",
        "skill-development-programs",
        "competitive-strategy",
        "led-teams-to-compete-successfully-at-the-highest-l-0ff9016a",
        "skill-56e36869",
        "skill-9ead72d6",
        "skill-32f296e2",
        "skill-fc1512b5",
        "the-leadership-and-analytical-skills-developed-in-f01c6596",
        "tag-b6e476a2",
        "tag-c993bcdd",
        "tag-afa53553",
        "tag-dd5d020a"
      ]
    },
    "portfolio-reflection": {
      "id": "portfolio-reflection",
      "type": "essay",
      "primitive": "Branch",
      "source": {
        "file": "examples/project-portfolio.mdx",
        "start": {
          "line": 453,
          "column": 3,
          "offset": 20386
        },
        "end": {
          "line": 475,
          "column": 11,
          "offset": 21754
        }
      },
      "attributes": {
        "type": "essay",
        "id": "portfolio-reflection",
        "title": "Lessons from Building"
      },
      "title": "Lessons from Building",
      "content": "Looking across this portfolio of projects, several themes emerge that have shaped my\napproach to software development and creative work:Iteration and Learning: Nearly every project has gone through multiple versions,\nredesigns, or pivots. This isn't failure - it's the natural process of learning and\nimproving. Each iteration teaches something new about the problem space, user needs,\nor technical constraints.Cross-Pollination: Skills learned in one domain consistently apply to others.\nLeadership from coaching translates to software team dynamics. Visual composition\nfrom photography improves UI design. Game development networking knowledge applies\nto web API design.Community and Open Source: The projects that have had the most impact are those\nthat solve problems for others, not just myself. Open source contributions and\ncommunity resources create value that extends far beyond the initial effort.Balance of Technical and Creative: The most fulfilling projects combine technical\nchallenges with creative expression or meaningful impact. Pure technical exercises\nare valuable for learning, but projects with purpose and personality are what I\nremember and continue to develop.",
      "children": []
    },
    "future-directions": {
      "id": "future-directions",
      "type": "project",
      "primitive": "Branch",
      "source": {
        "file": "examples/project-portfolio.mdx",
        "start": {
          "line": 477,
          "column": 3,
          "offset": 21758
        },
        "end": {
          "line": 501,
          "column": 13,
          "offset": 22905
        }
      },
      "attributes": {
        "type": "project",
        "id": "future-directions",
        "title": "Future Project Directions",
        "status": "planning"
      },
      "title": "Future Project Directions",
      "content": "Explore how AI tools can enhance development workflows and create new possibilities\nfor creative and productivity applicationsDevelop projects that have positive environmental impact or help others make more\nsustainable technology choicesCreate resources and tools that help other developers learn and grow, building on\nmy experience with documentation and teachingFuture projects will prioritize: meaningful impact, technical excellence, community value,\nand personal growth. The goal is to build things that matter, not just things that work.",
      "children": [
        "ai-integration-exploration",
        "sustainable-tech",
        "education-tools",
        "future-projects-will-prioritize:-meaningful-impact-476a2cad"
      ]
    },
    "tag-0f0b2e9d": {
      "id": "tag-0f0b2e9d",
      "type": "tag",
      "primitive": "Meta",
      "source": {
        "file": "examples/project-portfolio.mdx",
        "start": {
          "line": 503,
          "column": 3,
          "offset": 22909
        },
        "end": {
          "line": 503,
          "column": 28,
          "offset": 22934
        }
      },
      "metaType": "tag",
      "attributes": {
        "metaType": "tag",
        "value": "portfolio"
      },
      "value": "portfolio"
    },
    "tag-7fdc1bb8": {
      "id": "tag-7fdc1bb8",
      "type": "tag",
      "primitive": "Meta",
      "source": {
        "file": "examples/project-portfolio.mdx",
        "start": {
          "line": 504,
          "column": 3,
          "offset": 22937
        },
        "end": {
          "line": 504,
          "column": 39,
          "offset": 22973
        }
      },
      "metaType": "tag",
      "attributes": {
        "metaType": "tag",
        "value": "software-development"
      },
      "value": "software-development"
    },
    "tag-188ed460": {
      "id": "tag-188ed460",
      "type": "tag",
      "primitive": "Meta",
      "source": {
        "file": "examples/project-portfolio.mdx",
        "start": {
          "line": 505,
          "column": 3,
          "offset": 22976
        },
        "end": {
          "line": 505,
          "column": 29,
          "offset": 23002
        }
      },
      "metaType": "tag",
      "attributes": {
        "metaType": "tag",
        "value": "full-stack"
      },
      "value": "full-stack"
    },
    "tag-1553c5b4": {
      "id": "tag-1553c5b4",
      "type": "tag",
      "primitive": "Meta",
      "source": {
        "file": "examples/project-portfolio.mdx",
        "start": {
          "line": 506,
          "column": 3,
          "offset": 23005
        },
        "end": {
          "line": 506,
          "column": 30,
          "offset": 23032
        }
      },
      "metaType": "tag",
      "attributes": {
        "metaType": "tag",
        "value": "open-source"
      },
      "value": "open-source"
    },
    "tag-5fc3eeaf": {
      "id": "tag-5fc3eeaf",
      "type": "tag",
      "primitive": "Meta",
      "source": {
        "file": "examples/project-portfolio.mdx",
        "start": {
          "line": 507,
          "column": 3,
          "offset": 23035
        },
        "end": {
          "line": 507,
          "column": 29,
          "offset": 23061
        }
      },
      "metaType": "tag",
      "attributes": {
        "metaType": "tag",
        "value": "creativity"
      },
      "value": "creativity"
    },
    "tag-d63eb94f": {
      "id": "tag-d63eb94f",
      "type": "tag",
      "primitive": "Meta",
      "source": {
        "file": "examples/project-portfolio.mdx",
        "start": {
          "line": 508,
          "column": 3,
          "offset": 23064
        },
        "end": {
          "line": 508,
          "column": 29,
          "offset": 23090
        }
      },
      "metaType": "tag",
      "attributes": {
        "metaType": "tag",
        "value": "leadership"
      },
      "value": "leadership"
    },
    "time-spent-curating-and-documenting-this-comprehen-f00e4b7f": {
      "id": "time-spent-curating-and-documenting-this-comprehen-f00e4b7f",
      "type": "date",
      "primitive": "Meta",
      "source": {
        "file": "examples/project-portfolio.mdx",
        "start": {
          "line": 510,
          "column": 3,
          "offset": 23096
        },
        "end": {
          "line": 512,
          "column": 10,
          "offset": 23223
        }
      },
      "metaType": "date",
      "attributes": {
        "metaType": "date",
        "value": "2024-01-20",
        "duration": "360"
      },
      "value": "Time spent curating and documenting this comprehensive project portfolio"
    }
  },
  "metadata": {
    "generatedAt": "2025-09-20T11:27:31.523Z",
    "nodeId": "portfolio-showcase"
  }
}